src/toir_cfe/src/DataProcessors/проф_ПечатьАктВводаВЭксплуатацию/проф_ПечатьАктВводаВЭксплуатацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>проф_ПечатьАктВводаВЭксплуатацию</name>
</mdclass:DataProcessor>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/DataProcessors/проф_ПечатьАктВводаВЭксплуатацию/ObjectModule.bsl
//++ Проф-ИТ, #77, Башинская А., 13.10.2023	

#Область ПрограммныйИнтерфейс

Функция ПечатьАктВводаВЭксплуатацию(МассивОбъектов, ПараметрыПечати) Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("проф_АктВводаВЭксплуатацию");
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ТекстЗапросаПечатьАктВводаВЭксплуатацию(); 
	
	ОбщаяВыборка = Запрос.ВыполнитьПакет(); 
	ТЗОР = ОбщаяВыборка[0].Выбрать(); 
	ВыборкаРемонтныеРаботы = ОбщаяВыборка[1].Выбрать();  
		
	Для Каждого СсылкаНаОбъект Из МассивОбъектов Цикл  
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СсылкаНаОбъект);				
		Пока ТЗОР.НайтиСледующий(Отбор) Цикл
			
			ОбластьШапки   = Макет.ПолучитьОбласть("ОбластьШапка");
			ОбластьШапки.Параметры.Объект = ТЗОР.ОбъектРемонта;
			ТабДок.Вывести(ОбластьШапки);
			
			Отбор.Вставить("ID", ТЗОР.ID);
			
			ВывестиРемонтныеРаботы(ВыборкаРемонтныеРаботы, Отбор, ТабДок, Макет);
									
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #77
			ОбластьПодвал.Параметры.ТекущаяДата = Формат(ТекущаяДатаСеанса(),"ДЛФ=D");
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #77
			ТабДок.Вывести(ОбластьПодвал); 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		ТЗОР.Сбросить();
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПечатьАктВводаВЭксплуатацию()
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта.Наименование КАК ОбъектРемонта,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID КАК ID,
		|	ПРЕДСТАВЛЕНИЕ(торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота) КАК РемонтнаяРабота,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Выполнено КАК Выполнено,
		|	ЕСТЬNULL(торо_ТехнологическиеОперации.СодержаниеРабот, """") КАК СодержаниеРабот
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
		|		ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НомерСтроки";		
	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура ВывестиРемонтныеРаботы(ВыборкаРемонтныеРаботы, Отбор, ТабДок, Макет)

	Пока ВыборкаРемонтныеРаботы.НайтиСледующий(Отбор) Цикл 
		ОбластьСтрокаРодитель  = Макет.ПолучитьОбласть("ОбластьСтрокаРодитель"); 
		ОбластьСтрокаРабота  = Макет.ПолучитьОбласть("ОбластьСтрокаРабота"); 	
		Если ЗначениеЗаполнено(ВыборкаРемонтныеРаботы.Родитель_ID) Тогда 
			ОбластьСтрокаРабота.Параметры.Работа = ВыборкаРемонтныеРаботы.РемонтнаяРабота;
			ОбластьСтрокаРабота.Параметры.Выполнено = ?(ВыборкаРемонтныеРаботы.Выполнено = Истина, "b", "");
			ТабДок.Вывести(ОбластьСтрокаРабота);
			Если ЗначениеЗаполнено(ВыборкаРемонтныеРаботы.СодержаниеРабот) Тогда
				ОбластьСтрокаТехОперация  = Макет.ПолучитьОбласть("ОбластьСтрокаРабота");
				ОбластьСтрокаТехОперация.Параметры.Работа = ВыборкаРемонтныеРаботы.СодержаниеРабот; 
				ТабДок.Вывести(ОбластьСтрокаТехОперация);
			КонецЕсли;
		Иначе
			ОбластьСтрокаРодитель.Параметры.Родитель = ВыборкаРемонтныеРаботы.РемонтнаяРабота;
			ТабДок.Вывести(ОбластьСтрокаРодитель);
		КонецЕсли;	
	КонецЦикла;	
	ВыборкаРемонтныеРаботы.Сбросить();		
	
КонецПроцедуры	

#КонецОбласти

//-- Проф-ИТ, #77, Башинская А., 13.10.2023
